tutorials/WhiteMetzner/CarreauYasuda/constant/viscoelasticProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viscoelasticProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type WhiteMetznerCarreauYasuda;

rho              [1 -3 0 0 0 0 0] 850;
etaS             [1 -1 -1 0 0 0 0] 0.0;
etaP             [1 -1 -1 0 0 0 0] 3.14e2;
lambda           [0 0 1 0 0 0 0] 8.7487e-1;
K                [0 0 1 0 0 0 0] 6.0362e-1;
L                [0 0 1 0 0 0 0] 4.0056e1;
m                [0 0 0 0 0 0 0] 1.7314e-1;
n                [0 0 0 0 0 0 0] 6.4293e-2;
a                [0 0 0 0 0 0 0] 5.5061e-1;
b                [0 0 0 0 0 0 0] 2.3229e-1;


// ************************************************************************* //
